Revit 2026 API

# LoadBaseIsOrientToPermitted Method

---

Indicates if the provided orientation is permitted for this load.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsOrientToPermitted(
	LoadOrientTo orientTo
)
```
```vb
Public Function IsOrientToPermitted (
	orientTo As LoadOrientTo
) As Boolean
```
```cpp
public:
bool IsOrientToPermitted(
	LoadOrientTo orientTo
)
```
```fsharp
member IsOrientToPermitted :
        orientTo : LoadOrientTo -> bool
```

#### Parameters

orientTo LoadOrientTo
     Load orientation to check.

#### Return Value

Boolean True if provided orientation type is permitted for this load, false if not.

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

For hosted load only LoadOrientTo.Project and LoadOrientTo.HostLocalCoordinateSystem are permitted. For non-hosted load only LoadOrientTo.Project and LoadOrientTo.WorkPlane are permitted. To determine if load is hosted use IsHosted property.

#### Reference

LoadBase Class

Autodesk.Revit.DB.Structure Namespace